let handler = async (m, { conn, usedPrefix, command, text }) => {
    let img1 = 'https://telegra.ph/file/b9b4ff9c328cfe440f91f.jpg';
    let img2 = 'https://telegra.ph/file/af5ccc5465eaf7c992d41.jpg';
    let img3 = 'https://telegra.ph/file/f3da2861eecd22c94eccd.png';
    let img4 = 'https://telegra.ph/file/fac77b35f03be91331101.jpg';
    let img5 = 'https://telegra.ph/file/94ca0157e25f6483785b8.jpg';
    let img6 = 'https://telegra.ph/file/ded95fbfe8b0d0a74675b.jpg';
    let img7 = 'https://telegra.ph/file/904b5a88b9bc88a6b34d9.jpg';
    let img8 = 'https://telegra.ph/file/b381868f907972dd54951.jpg';
    let img9 = 'https://telegra.ph/file/380264a7e44a8a86df4e4.jpg';

    const messages = [
        [
            `> ~*⊹‏⊱≼━━━⌬〔👾〕⌬━━━≽⊰⊹*~
*ほالـمــــجــــمــــوعـــــــات⤣⛈️⤤〆*
> ~*⊹‏⊱≼━━━⌬〔⏳〕⌬━━━≽⊰⊹*`,
            `*⛈️➜⃞「منشن」*
*⛈️➜⃞「مخفي」*
*⛈️➜⃞「الادمن」*
*⛈️➜⃞「الاشباح」*
*⛈️➜⃞「الجروب」*
*⛈️➜⃞「جروب غلق」*
*⛈️➜⃞「جروب فتح」*
*⛈️➜⃞「جروب قفل」*
*⛈️➜⃞「جروب الغاء-القفل」*
*⛈️➜⃞「ترقيه」*
*⛈️➜⃞「اعفاء」*
*⛈️➜⃞「طرد」*
*⛈️➜⃞「اضف」*
*⛈️➜⃞「رستر」*
*⛈️➜⃞「لينك」*
*⛈️➜⃞「انذار」*
*⛈️➜⃞「رفع-الانذار」*
*⛈️➜⃞「الانذارات」*
*⛈️➜⃞「تغيير-الصوره」*
*⛈️➜⃞「تغيير-الاسم」*
*⛈️➜⃞「تغيير-الوصف」*
*⛈️➜⃞「تغيير-الوداع」*
*⛈️➜⃞「تغيير-الترحيب」*
~*⊹‏⊱≼━━━⌬〔⏳〕⌬━━━≽⊰⊹*~
> *© 𝐸𝐿𝐴𝐾𝑅𝐸𝐵...*`,
            img1,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201028085788'], ['「❄ ╎الــقــــناه❄ 」', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            `> ~*⊹‏⊱≼━━━⌬〔⚜️〕⌬━━━≽⊰⊹*~
*ほالـألـــــــعــــــــــــاب⤣🎳⤤〆*
> ~*⊹‏⊱≼━━━⌬〔👾〕⌬━━━≽⊰⊹*~`,
            `*🦈✭⃝↫ 「العاب لمعرفة المطلوب من الصور」↶*
*🦈➜⃞「احزر」*
*🦈➜⃞「عين」*
*🦈➜⃞「علم」*
*🦈➜⃞「اوست」*
*🦈➜⃞「نادي」*
*🦈➜⃞「سيارات」*
*🦈➜⃞「كوره」*
*🦈➜⃞「ناروتو」*

*🦈✭⃝↫ 「العاب أسئلة متنوعة」↶*
*🦈➜⃞「دين」*
*🦈➜⃞「ثقافة」*
*🦈➜⃞「قولة」*
*🦈➜⃞「سؤال」*
*🦈➜⃞「تخمين」*
*🦈➜⃞「خمن」*
*🦈➜⃞「ايمو」*
*🦈➜⃞「رياضه」*

*🦈✭⃝↫ 「العاب متطورة」↶*
*🦈➜⃞「اكس او」*
*🦈➜⃞「حساب」*
*🦈➜⃞「تحدي」*
*🦈➜⃞「رهان」*
*🦈➜⃞「جنيه」*
*🦈➜⃞「المتفجرات」*
*🦈➜⃞「قريبا انشاء الله」*

*🦈✭⃝↫ 「العاب النقابات」↶*
*🦈➜⃞「قلوب」*
*🦈➜⃞「الأشباح」*
*🦈➜⃞「قريبا」*
*🦈➜⃞「قريبا」*

*🦈✭⃝↫ 「العاب كتابة تفكيك الخ...」↶*
*🦈➜⃞「كت」*
*🦈➜⃞「رتب」*
*🦈➜⃞「فكك」*
*🦈➜⃞「عكس」*
*🦈➜⃞「قريبا...」*
*🦈➜⃞「قريبا...」*

~*⊹‏⊱≼━━━⌬〔⏳〕⌬━━━≽⊰⊹*~
> *© 𝐸𝐿𝐴𝐾𝑅𝐸𝐵...*`,
            img2,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201028085788'], ['「❄ ╎قــناتــــي╎❄ 」', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            `> ~*⊹‏⊱≼━━━⌬〔🦂〕⌬━━━≽⊰⊹*~
*ほالــــتـــــــرفــــيـــــه⤣🎻⤤〆*
> ~*⊹‏⊱≼━━━⌬〔👾〕⌬━━━≽⊰⊹*~`,
            `*💭➜⃞「ورع @tag」*
*💭➜⃞「اهبل @tag」*
*💭➜⃞「خروف @tag」*
*💭➜⃞「جميل @tag」*
*💭➜⃞「فخم @tag」*
*💭➜⃞「أنوثه @tag」*
*💭➜⃞「رجوله @tag」*
*💭➜⃞「ذكاء @tag」*
*💭➜⃞「شجاعة @tag」*
*💭➜⃞「حظ @tag」*
*💭➜⃞「مرح @tag」*
*💭➜⃞「عبقرية @tag」*
*💭➜⃞「قوة @tag」*
*💭➜⃞「ذكاء_عاطفي @tag」*
*💭➜⃞「ابداع @tag」*
*💭➜⃞「سعادة @tag」*
*💭➜⃞「رومانسية @tag」*
*💭➜⃞「جاذبية @tag」*
*💭➜⃞「كاريزما @tag」*
*💭➜⃞「الكره @tag」*
*💭➜⃞「الحب @tag」*
*💭➜⃞「الشوق @tag」*
*💭➜⃞「الحزن @tag」*
*💭➜⃞「الغضب @tag」*
*💭➜⃞「 زواج  」*
*💭➜⃞「 طلاق 」*
*💭➜⃞「 توئمي 」*
*💭➜⃞「 رفيقي 」*
*💭➜⃞「 بيستو 」*
*💭➜⃞「 كراشي」*
~*⊹‏⊱≼━━━⌬〔👾〕⌬━━━≽⊰⊹*~
> *© 𝐸𝐿𝐴𝐾𝑅𝐸𝐵...*`,
            img3,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201028085788'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'باقي القوئم قريبا',
            `وصف الرسالة 4
احم
احم
احم`,
            img4,
            [], [],
            [['زر 7', 'https://wa.me/201028085788'], ['زر 8', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'عنوان 5',
            `وصف الرسالة 5
احم
احم
احم`,
            img5,
            [], [],
            [['زر 9', 'https://wa.me/201028085788'], ['زر 10', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'عنوان 6',
            `وصف الرسالة 6
احم
احم
احم`,
            img6,
            [], [],
            [['زر 11', 'https://wa.me/201028085788'], ['زر 12', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'عنوان 7',
            `وصف الرسالة 7
احم
احم
احم`,
            img7,
            [], [],
            [['زر 13', 'https://wa.me/201028085788'], ['زر 14', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'عنوان 8',
            `وصف الرسالة 8
احم
احم
احم`,
            img8,
            [], [],
            [['زر 15', 'https://wa.me/201028085788'], ['زر 16', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ],
        [
            'عنوان 9',
            `وصف الرسالة 9
احم
احم
احم`,
            img9,
            [], [],
            [['زر 17', 'https://wa.me/201028085788'], ['زر 18', 'https://whatsapp.com/channel/0029VahbMZl4tRrkdpJrCv2f']],
            []
        ]
    ];

    // إرسال رسالة الكيروسيل
    await conn.sendCarousel(m.chat, `بسم الله الرحمن الرحيم
> انا لست مسؤولا عن أي اسائة لاستخدام مزايا واوامر البوت
*────────────────⟢*
*⤣🦈⤤يمنع استخدام البوت في الخاص*
*⤣🦈⤤يمنع شتم او سب البوت*
*⤣🦈⤤يمنع البحث عن محتوى اباحي بواسطة البوت*
*────────────────⟢*`, '*⚜𝗕𝗢𝗧 👾 𝗘𝗟𝗔𝗞𝗥𝗔𝗕⚜*', '*⚜𝗕𝗢𝗧 👾 𝗘𝗟𝗔𝗞𝗥𝗔𝗕⚜*', messages, m);
}

handler.command = /^(اوامر1)$/i; // Command to trigger the handler function

export default handler;