let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*┌────「❄️」─*\n*“${pickRandom(global.bucin)}”*\n*└────「❄️」─*`, m)
}
handler.help = ['reto']
handler.tags = ['fun']
handler.command = /اسئلني/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.bucin = [ 
 "تتوقع أحد يسأل عنك لو غبت فترة ؟", 
 "اكثر كذبة مشهوره تسمعها حولك؟", 
 "أكله مستحيل تاكلها؟ ", 
 "وش السيء في حياتك اليوميه؟ ؟", 
 "اعلي مجموع جبته فحياتك ؟", 
 "اكتر حاجة خايف تخسرها ؟", 
 " لو قدامك تغير حاجه ف الحياة ف وش هي(الاقدار في يد الله مجرد سؤال) ؟",  
 "عمرك سويت خدمة لشخص وبعدها جحدك ؟",  
 " عمرك طحت ف المدرسة ؟ وكم مرة ؟", 
 "لو زعلت تاكل ولا لا ؟ ",   
 " لو حطوك في مستشفي المجانين بالغلط , كيف بتثبت لهم انك عاقل",  
 "تتوقع اشباهك ال 40 عايشين حياة حلوه ولا زي حياتك التعيسه ؟",  
 "اسم اقرب شخص لقلبك ؟",  
 "منشن اثنين تحسهم نفس الشخصية",  
 "كلمة لشخص غدرك او خانك !؟", 
  "لو حياتك عباره عن كتاب وش بيكون اسمه؟", 
  " لو انسجنت (بعد الشر عنك/ي  ) تتوقع التهمة وش بتكون ؟",    
 "ممكن تترك شخص عشان ماضيه(سواء حب او صداقة) ؟",  
 "حاجه م تسويها الا وانت رايق ؟ ", 
  " وش الاحسن تتبع دائما العقل ولا القلب ؟", 
  " شخص م تطيق تشوفه واذا شفته يغبنك ؟", 
  "منشن شخص وقوله انت اسطورة", 
  "اكتر حاجه تتمنى تنساها ؟",  
  "شعور تتمنى انك ماجربته ؟", 
  "تقدر تعيش من غير اخويا ؟", 
  " التاريخ الي تنتظره كل سنه او مره وحده ( السنة او اليوم  )",  
 " اسم الدوله الي تتمنى تعيش فيها ؟",  
 "انت شايف نفسك اجتماعي ولا انطوائي ؟ ",  
 "شخصية خيالية ( كرتونية ) تأثرت بها ؟", 
  "كلمات او كلمه تعبر عن حياتك ؟", 
  " شخص  تفكر فيه قبل ما تنام ؟",  
  "اكتر حاجه تخوفك ؟", 
  "اغنية لازقة ف مخك (كل واحد مسؤول عن سيئات الاغنيه لو بحث عنها اللهم بلغت اللهم فاشهد )", 
  "أكثر صديق مقرب لك ؟ ",  
 "احسن حاجة صارت لك اليوم ؟",  
 "جربت الشهره ولا تتمناها ؟", 
  " ممكن تبيع خويك عشان مصلحتك ؟", 
  " اغرب اكله تتمنى تجربها جت ببالك فجاه ؟", 
  " تحب/ي القطط ؟", 
  " أكثر صفة تكرهها ف خويك ؟",  
  "اسمك الكامل ؟", 
  
 "اكثر حرف تحبه ؟", 
  
 "اكثر شخص تحسه متبلد وبدون شعور بالقروب ؟", 
  
 "لو لقيت ورقة بيضه وقلم وش بترسم عشان تعبر عن حياتك ؟", 
  
 "اكتر شهر تفرح وتستانس اذا جاء ؟", 
  
 "قول حقيقة عنك ؟", 
  
 "الاصدق ف الحب الولد ولا البنت ؟", 
  
 "كلمات ماتقدر تستغني عنها ؟", 
  
 "اكتر حاجه انت خايف تخسرها ؟", 
  
 "اكتر صفة ماتحبها ف البنت ؟", 
  
 "اكتر مادة تحبها ف الدراسة ؟", 
  
 "تسامح شخص خانك ( أوجع قلبك )", 
  
 "أكثر شيء تسويه وتتمنى تتركه ؟", 
  
 "عبر عن احساسك حاليا بجمله ؟", 
  
 "تصنيف الافلام او -الكرتون - الانمي الي تحب تتابعه ؟", 
  
 " أنت مع الخطبة عن حب او مع الخطبة عن طريق الأهل؟", 
  
 "منشن احد تحس شكله حلو ", 
  
 "ماهو مبدأك ف الحياة ؟", 
  
 "تحب الاطفال؟",
  
 "اخر خبر حلو كان ومتى ووش كان اذا تقدر تقوله ؟", 
  
  
 "لو حياتك زي لون لبسك وش بتكون ؟", 
  
 "ـ الفتره هذي أحس اني محتاج ....؟", 
  
 "قد بكيت على شخصيه ماتت ف فلم او مسلسل او انمي ؟", 
  
 "ممكن تكره الشخص الي كنت تحبه ؟",  
  
 "تعرضت للظلم قبل ووش كان موقفك ؟", 
  
 "اكثر مكان بتحس فيه بالراحه والامان ؟", 
  
 "ارسل اخر صوره حفظتها في جوالك  ..", 
  
 "جمله من كتاب او روايه ماقدرت تنساها ؟", 
  
  
 "اكتر مكان تحس فيه بالامان ؟", 
  
 "اكتر حاجه تخاف منها ؟", 
  
 "لو انت غلطت وعرفت انك الغلطان راح تعتذر ولا تبقى حمار وتكابر؟ ؟", 
  
 "صفات الصديق الحقيقي ف رايك ؟", 
  
 "مع او ضد : اكتر من يحلون مشاكل الناس هم اكثر  من لديهم مشاكل ؟", 
  
 "اكثر هديه نفسك فيها حاليًا؟",
  
 "ترضي تتزوج احد فقير بس جميل ؟", 
  
 "من غرائب لهجتكم ؟", 
  
 "احد عطاك بلوك قبل كذا وانت تكتب له",
  
 "اكتر جمله اثرت فحياتك ؟", 
  
 " لو بترجع للماضي وتسمي نفسك بتبقى على نفس اسمك ولا بتغيره ؟", 
  
 "عمرك تمنيت الموت (لايجوز والعياذ بالله)؟", 
  
 "حبيت احد ببرامج التواصل قبل كذا ؟", 
  
 " النفس تميل لـ ... ؟", 
  
 "جربت شعور احد يحبك بس انت ماقدرت تحبه ؟", 
  
 "كلمة تقولها لكل واحد منافق ؟", 
  
 "اكثر شخص تفكر فيه ؟", 
  
 "اكثر حاجه انت كارهها فنفسك ؟", 
  
 "فرحان ولا زعلان ؟", 
  
 "مع ام ضد : لو كان خيرا لبقي ؟", 
  
 "حبيت حد من دفعة دراستك قبل كذا",

   " نفسك تتزوج الحين ولا مو مستعد ؟", 
  
 "عبر عن نفسك في ثلاث كلمات ", 
  
 " أغرب موقف مضحك حصلك في حياتك؟", 
  
 "قوة الاستيعاب عندك كم من 10", 
  
 "اذكر موقف م قدرت تنساه طول عمرك؟", 
  
 "اغبى كذبه صدقتها وانت/ي صغير/ة؟", 
  
 "فكرت قبل كدا تنتقم من الي ظلمك ؟", 
  
 "بتنام كم ساعه في اليوم ؟", 
   
 "مع او ضد : السفر يصلح ما افسده الدهر ؟", 
  
 "احسن ايام الاسبوع عندك 🔖؟", 
  
 "تتزوج الي بتحبه/ا او تاخد مليون دولار", 
  
 "على نياتكُم تُرزقون منشن احد ينطبق عليه المثل ذا؟",
  
 "هل يمكنك أن تذكر لي معلومة لا يعرفها عنك أحد؟", 
  
 "اكتر شيخ تحبه ؟", 
  
 "كيف تتعامل  مع الشخص المُتطفل ( الفضولي ) ؟", 
  
 "موقف غير حياتك؟", 
  
 "تتوقع احد يفكر فيك الوقت الراهن(الان) ؟",  
  
 "لو عندك امنيه سحريه وحده وش بتكون ",
  
 "حاس بالذنب ع حاجه معينه ؟", 
  
 "كم تحتاج وقت عشان تثق ف شخص", 
  
 "اكثر حاجه تخلسك تضحك من اعماق قلبك ؟", 
  
 "حيوانك المفضل؟", 
  
 "🥰تحب احد ف القروب", 
  
 "صفة بتحبها في الناس ؟", 
  
 "اسأل نفسك هل فيه شخص يحبك الحين ؟", 
  
 "شعورك لما بتشوف صورة لك وانت صغير ؟", 
  
 "لو حد طنشك عن قصد وش بتسوي له ؟", 
  
 "لو معاك ١٥ ثانيه تعبر عن نفسك فيها وش بتكتب ؟", 
  
 "عدد الصور في جوالك ؟", 
  
 "ايهما اصدق نظره العين ولا نبره الصوت ؟", 
  
 "لو عزمت اخوياك وجابو شخص تكرهه وش بتسوي ووش بيكون موقفك ؟", 
  
 "حاجه اهم عندك من الناس ؟", 
  
 "الاسود ولا الابيض ؟", 
  
 "تحب الرسوم المتحركه (الانمي -الكرتون)", 
  
 "تحب احد ؟", 
  
 "ممكن تاذي احد عشان انك تكرهه؟ ؟", 
  
 "اسم الدلع الي م تحبه ينادونك به ؟", 
  
 "اخر شاات كان مع مين اعتررفف ؟", 
  
  
 " مو مو سؤال بس *صلي علي الرسول*🥹", 
  
 "عبر عن نفسك بإيموجي الان",
  
 "بتضيع وقت فراغك في وش ؟",  
  
 "اكثر ادمن مو طايقه او تحسه مستقعد لك ؟", 
  
  
 "هل انت تافه ؟", 
  
 "اكثر اسم دلع بتحبه ؟", 
  
 "لو بتقيم حظك كم بتعطيه من عشره ؟", 
  
 "تختار المال ولا الصحة ولا الرضا ؟", 
  
 "علاقتك مع أخوانك/اخواتك من عشره؟ ؟ ", 
  
 "لو سافرت بالزمن للحقبه الزمنيه الي تبغي تبني فيها حياتك بتكون اي حقبه ؟", 
  
 "حاجه اهلك كارهينها فيك ؟", 
  
 "احقر الناس الي ...", 
  
 "الطلعه الحلوه بالمكان ولا الشخص الي انت خارج معاه ؟", 
  
 "كلمة تنرفزك ؟", 
  
 "اكثر شخصية مشهوره بتحبها ؟", 
  
 "حاجه تخطف النوم من عينك ؟", 
  
 "وش اخر رسالة جاتك في الواتس",
  
 "تقييمك للبوت من عشره ؟", 
  
 "عندك استعداد ترسل خلفية جوالك(لو ايه ارسلها) ؟", 
  
 " صفة في نفسك تتمني تغيرها ؟", 
  
 "اكتب شطر من قصيدة جت فـ بالك ؟", 
  
 "تخاف من حاجه معينه ؟", 
  
 "وش الحاجه الي تحس انها تميزك عن باقي الناس ؟", 
  
 "افضل مكان تحب تروح له ؟", 
  
 "سر امها مالي خلق اكتب شيء هنا", 
  
 "لو كسبت خمسه مليون دولار وش بتصرفها فيه ؟", 
  
 "لو بتكون عايش ف اخر لعبه لعبتها وش بتكون اللعبه ؟", 
  
 "اكتر انمي - فيلم حبيته فحياتك ؟", 
  
 "اكتر حاجه تحتاجها في الوقت ؟", 
  
 "رساله تبغى تقولها لشخص ومو عارف كيف ؟", 
  
 " من وقتك تصلي ع الرسول صلي الله عليه وسلم 💫", 
  
 "دقيقه من وقتك تدعو لامواتنا واموات المسلمين بالرحمة 🤲🏻", 
  
 "اكتر لغة نفسك تتعلمها ؟", 

 "لو بتسافر برا من بتاخذ معك من اعضاء القروب",
   
 ] 
