let handler = async (m, { conn }) => {
m.reply(global.terminos)}
handler.customPrefix = /términos y condiciones y privacidad|terminosycondicionesyprivacidad|terminosycondiciones|privacidad|الاستخدام|الخصوصيه|الخصوصية|الخصوصيه ولا الاستخدام|شروط الخصوصية|شروط الخصوصيه|شروط الاستخدام/i
handler.command = new RegExp
export default handler

global.terminos = `
*❈↲ الجهل بما هو مذكور هنا يعفي مالك الروبوت أو الروبوت الفرعي أو مستخدم الروبوت من العقوبات التي قد تنشأ عن ذلك❗*

----------------
*⚠️ شروط الخصوصية*
❈↲ لا تتم مشاركة المعلومات التي يتلقاها البوت مع أي طرف ثالث أو مع أي شخص آخر
❈↲ لا يتم مشاركة الصور / مقاطع الفيديو / الملصق / الصوتيات / إلخ مع أي شخص
❈↲ لا يتم مشاركة رقم هاتفك مع أي شخص
❈↲ يتم حذف بيانات البطاقة والمواقع والعناوين وما إلى ذلك على الفور ولا تتم مشاركتها مع أي شخص
❈↲ يتم حذف جميع المحادثات من وقت لآخر ولا يتم عمل نسخة احتياطية (غير محفوظة) لأي نوع من المعلومات / المحادثات

----------------
*⚠️ شروط الاستخدام*
❈↲ غير مسؤول عن سوء استخدام البوت
❈↲ غير مصؤول عن الجهل او استخدام البوت فيما لا يرضي الله
❈↲ البوت ليس شغال 24 ساعه مالم يحدث خلاف ذلك 
❈↲ انا لست مسؤول عن اي ارقام تذهب الى دعم البوت
❈↲ الصوتيات / الملاحظات الصوتية / الصور / مقاطع الفيديو أو أي ملفات وسائط متعددة أخرى للبوت هي مش مع حد إذا تم اكتشاف بوت آخر مع واحد أو أكثر من ملفات الوسائط المتعددة المذكورة أعلاه ، فسيتم أخذها رسائل في الموضوع.

❈↲  ذا تلقيت في أي وقت رسالة من رقم البوت ولم يكن ذلك أمرًا ، فقد يكون من مالك البوت أو صاحب الرقم ، فهذا شخص حقيقي يرجي احترامه 

----------------

❈↲ *⁉️ لو عندك استفسار في اي نقطه كلم المطور*
❈↲ لو عندك اي اسئلة او شك من حاجه معينه كلم المطور وان شاء الله يرذ في اقرب وقت ممكن_ 
❈↲ المطور
رقم مطور هذه النسخه :
❈↲ https://wa.me/+972512997441 '
