let handler = async (m, { conn, text}) => {
m.reply(`*╔═══════════════════════════*\n➢ *"${pickRandom(global.piropo)}"*\n*╚═══════════════════════════*`)
}
handler.tags = ['islam']
handler.command = ['حديث','احاديث']
 export default handler
    
 function pickRandom(list) {
 return list[Math.floor(list.length * Math.random())]}
    
 global.piropo = [
"لَمَّا خَلَقَ اللَّهُ الخَلْقَ، كَتَبَ في كِتَابِهِ، فَهو عِنْدَهُ فَوْقَ العَرْشِ: إنَّ رَحْمَتي تَغْلِبُ غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"لَمَّا قَضَى اللَّهُ الخَلْقَ، كَتَبَ في كِتَابِهِ علَى نَفْسِهِ، فَهو مَوْضُوعٌ عِنْدَهُ إنَّ رَحْمَتي تَغْلِبُ غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"قالَ اللَّهُ عَزَّ وَجَلَّ: سَبَقَتْ رَحْمَتي غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"صَلَّيْتُ مع أبِي مُوسَى الأشْعَرِيِّ صَلَاةً فَلَمَّا كانَ عِنْدَ القَعْدَةِ قالَ رَجُلٌ مِنَ القَوْمِ: أُقِرَّتِ الصَّلَاةُ بالبِرِّ والزَّكَاةِ؟ قالَ فَلَمَّا قَضَى أبو مُوسَى الصَّلَاةَ وسَلَّمَ انْصَرَفَ فَقالَ: أيُّكُمُ القَائِلُ كَلِمَةَ كَذَا وكَذَا؟ قالَ: فأرَمَّ القَوْمُ، ثُمَّ قالَ: أيُّكُمُ القَائِلُ كَلِمَةَ كَذَا وكَذَا؟ فأرَمَّ القَوْمُ، فَقالَ: لَعَلَّكَ يا حِطَّانُ قُلْتَهَا؟ قالَ: ما قُلتُهَا، ولقَدْ رَهِبْتُ أنْ تَبْكَعَنِي بهَا فَقالَ رَجُلٌ مِنَ القَوْمِ: أنَا قُلتُهَا، ولَمْ أُرِدْ بهَا إلَّا الخَيْرَ فَقالَ أبو مُوسَى: أما تَعْلَمُونَ كيفَ تَقُولونَ في صَلَاتِكُمْ؟ إنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ خَطَبَنَا فَبَيَّنَ لَنَا سُنَّتَنَا وعَلَّمَنَا صَلَاتَنَا. فَقالَ: إذَا صَلَّيْتُمْ فأقِيمُوا صُفُوفَكُمْ ثُمَّ لْيَؤُمَّكُمْ أحَدُكُمْ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وإذْ قالَ {غَيْرِ المَغْضُوبِ عليهم ولَا الضَّالِّينَ} [الفاتحة: 7]، فَقُولوا: آمِينَ، يُجِبْكُمُ اللَّهُ فَإِذَا كَبَّرَ ورَكَعَ فَكَبِّرُوا وارْكَعُوا، فإنَّ الإمَامَ يَرْكَعُ قَبْلَكُمْ، ويَرْفَعُ قَبْلَكُمْ، فَقالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: فَتِلْكَ بتِلْكَ وإذَا قالَ: سَمِعَ اللَّهُ لِمَن حَمِدَهُ. فَقُولوا: اللَّهُمَّ رَبَّنَا لكَ الحَمْدُ يَسْمَعُ اللَّهُ لَكُمْ، فإنَّ اللَّهَ تَبَارَكَ وتَعَالَى، قالَ علَى لِسَانِ نَبِيِّهِ صَلَّى اللَّهُ عليه وسلَّمَ: سَمِعَ اللَّهُ لِمَن حَمِدَهُ وإذَا كَبَّرَ وسَجَدَ فَكَبِّرُوا واسْجُدُوا فإنَّ الإمَامَ يَسْجُدُ قَبْلَكُمْ ويَرْفَعُ قَبْلَكُمْ فَقالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: فَتِلْكَ بتِلْكَ، وإذَا كانَ عِنْدَ القَعْدَةِ فَلْيَكُنْ مِن أوَّلِ قَوْلِ أحَدِكُمْ: التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللهِ الصَّالِحِينَ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ. وفي رواية: فإنَّ اللَّهَ عزَّ وجلَّ قَضَى علَى لِسَانِ نَبِيِّهِ صَلَّى اللَّهُ عليه وسلَّمَ سَمِعَ اللَّهُ لِمَن حَمِدَهُ.\n\n- الراوي: أبو موسي الاشعري\n- حكم الحديث: [صحيح]",
